# Chapter 5: Sample Notebook

This notebook contains all code from Chapter 5: _Working with Tabular Data: The Pandas Package_.

In [1]:
import numpy as np
import pandas as pd

## 5.1 The Main Objects in Pandas

### 5.1.1 The Pandas DataFrame

In [2]:
dfGM = pd.DataFrame({'GVKEY': '005073', 
                     'FYEAR': np.arange(2013, 2018), 
                     'TIC': 'GM', 
                     'IB': [5346.0, 3949, 9687, 9427, 348], 
                     'PRCC_F': [40.87, 34.91, 34.01, 34.84, 40.99]})
dfGM

    GVKEY  FYEAR TIC      IB  PRCC_F
0  005073   2013  GM  5346.0   40.87
1  005073   2014  GM  3949.0   34.91
2  005073   2015  GM  9687.0   34.01
3  005073   2016  GM  9427.0   34.84
4  005073   2017  GM   348.0   40.99

### The Pandas Series

In [3]:
dfGM['IB']

0    5346.0
1    3949.0
2    9687.0
3    9427.0
4     348.0
Name: IB, dtype: float64

## 5.3 Importing Data

### 5.3.1 Importing Data from Excel

In [4]:
import numpy as np
import pandas as pd

# Assume the Excel file is located in the same folder
# as the code file.
df = pd.read_excel('Ch5_Data_Example1.xlsx')

df

  Company Name Ticker  Closing Price
0    Microsoft   MSFT         138.43
1        Apple   AAPL         240.51
2       Google   GOOG        1246.15
3       Oracle   ORCL          55.13
4          SAP    SAP         132.71

#### Using `pd.read_excel` with an Excel Workbook Containing Multiple Worksheets

In [5]:
# Assume pandas has already been imported

# Assume the Excel file is located in the same folder
# as the code file.
df = pd.read_excel('Ch5_Data.xlsx', sheet_name='Other Stocks')
df

  Company,Name Ticker  Closing Price
0    Microsoft   MSFT         138.43
1        Apple   AAPL         240.51
2       Google   GOOG        1246.15
3       Oracle   ORCL          55.13
4          SAP    SAP         132.71

#### Using `pd.read_excel` When the Header Row is Missing

In [6]:
# Assume pandas has already been imported, and the Excel
# file is located in the same folder as the code file.
df = pd.read_excel('Ch5_Data.xlsx', 
                   sheet_name='MSFT No Header',
                   header=None,
                   names=['DATADATE', 'FYEAR', 'AT', 'CEQ', 'IB', 
                          'PRCC_F_ADJ', 'ADD1', 'ZIP', 'CITY', 'STATE'])
df.head()

,DATADATE,FYEAR,AT,CEQ,IB,PRCC_F_ADJ,ADD1,ZIP,CITY,STATE
0,1986-06-30,1986,170.739,139.332,39.254,0.068926,One Microsoft Way,98052,Redmond,wa
1,1987-06-30,1987,287.754,239.105,71.878,0.228631,One Microsoft Way,98052,Redmond,wa
2,1988-06-30,1988,493.019,375.498,123.908,0.300359,One Microsoft Way,98052,Redmond,wa
3,1989-06-30,1989,720.598,561.780,170.538,0.237597,One Microsoft Way,98052,Redmond,wa
4,1990-06-30,1990,1105.349,918.563,279.186,0.681410,One Microsoft Way,98052,Redmond,wa

#### Skipping Rows and Blank Lines

In [7]:
# Assume pandas has already been imported, and the Excel
# file is located in the same folder as the code file.
df = pd.read_excel('Ch5_Data.xlsx', 
                   sheet_name='MSFT Extraneous Lines',
                   skiprows=5)
df.head()

,Data Date,Fiscal Year,Assets - Total,Common Equity,Net Income,Adjusted Price Close - Fiscal,Address,ZIP Code,City,State
0,1986-06-30,1986,170.739,139.332,39.254,0.068926,One Microsoft Way,98052,Redmond,wa
1,1987-06-30,1987,287.754,239.105,71.878,0.228631,One Microsoft Way,98052,Redmond,wa
2,1988-06-30,1988,493.019,375.498,123.908,0.300359,One Microsoft Way,98052,Redmond,wa
3,1989-06-30,1989,720.598,561.780,170.538,0.237597,One Microsoft Way,98052,Redmond,wa
4,1990-06-30,1990,1105.349,918.563,279.186,0.681410,One Microsoft Way,98052,Redmond,wa

In [8]:
# Assume pandas has already been imported, and the Excel
# file is located in the same folder as the code file.
df = pd.read_excel('Ch5_Data.xlsx', 
                   sheet_name='MSFT Extraneous Lines',
                   skiprows=5)
df.head()

,Data Date,Fiscal Year,Assets - Total,Common Equity,Net Income,Adjusted Price Close - Fiscal,Address,ZIP Code,City,State
0,1986-06-30,1986,170.739,139.332,39.254,0.068926,One Microsoft Way,98052,Redmond,wa
1,1987-06-30,1987,287.754,239.105,71.878,0.228631,One Microsoft Way,98052,Redmond,wa
2,1988-06-30,1988,493.019,375.498,123.908,0.300359,One Microsoft Way,98052,Redmond,wa
3,1989-06-30,1989,720.598,561.780,170.538,0.237597,One Microsoft Way,98052,Redmond,wa
4,1990-06-30,1990,1105.349,918.563,279.186,0.681410,One Microsoft Way,98052,Redmond,wa

#### Getting Help with `pd.read_excel`

In [ ]:
help(pd.read_excel)

### 5.3.2 Importing Data from a CSV file

#### Converting Accounting Strings to `float`

In [10]:
import numpy as np
import pandas as pd

# Assume the file is in the same folder
df = pd.read_csv('Ch5_Acctg_Format.csv')

# Remove comma, right parenthesis, dollar sign
df['Income'] = df['Income'].str.replace('[,\)\$]', '', regex=True)
# Replace left parenthesis with negative sign
df['Income'] = df['Income'].str.replace('(', '-')
# Convert column to float
df['Income'] = df['Income'].astype(float)

df

   Year   Income
0  2016 -16798.0
1  2017  21204.0
2  2018 -16571.0
3  2019  39240.0

#### Parsing Dates

In [11]:
dfDates = pd.read_csv('Ch5_Dates.csv', parse_dates=['Date1'])
dfDates

       Date1      Date2      Date3    Company Name Ticker  Closing Price
0 2019-04-08   8/4/2019  08 Apr 19  General Motors     GM          39.06
1 2019-04-09   9/4/2019  09 Apr 19  General Motors     GM          38.86
2 2019-04-10  10/4/2019  10 Apr 19  General Motors     GM          39.25

In [12]:
dfDates = pd.read_csv('Ch5_Dates.csv', parse_dates=['Date1', 'Date3'], infer_datetime_format=True)
dfDates

       Date1      Date2      Date3    Company Name Ticker  Closing Price
0 2019-04-08   8/4/2019 2019-04-08  General Motors     GM          39.06
1 2019-04-09   9/4/2019 2019-04-09  General Motors     GM          38.86
2 2019-04-10  10/4/2019 2019-04-10  General Motors     GM          39.25

In [13]:
dfDates['Date2'] = pd.to_datetime(dfDates['Date2'], format='%d/%m/%Y')
dfDates

       Date1      Date2      Date3    Company Name Ticker  Closing Price
0 2019-04-08 2019-04-08 2019-04-08  General Motors     GM          39.06
1 2019-04-09 2019-04-09 2019-04-09  General Motors     GM          38.86
2 2019-04-10 2019-04-10 2019-04-10  General Motors     GM          39.25

### 5.3.5 Manually Creating a DataFrame

In [14]:
s = pd.Series([1,2,3,4])
print(f'Series s:\n{s}\n')

df = pd.DataFrame({'X': [1,2,3,4], 'X_sq': [1,4,9,16]})
print(f'DataFrame df:\n{df}')

Series s:
0    1
1    2
2    3
3    4
dtype: int64

DataFrame df:
   X  X_sq
0  1     1
1  2     4
2  3     9
3  4    16

## 5.5 Selecting and Filtering Data

### 5.5.1 Retrieving One or More Columns as a DataFrame

#### Retrieving One or More Columns as a DataFrame

In [16]:
import numpy as np
import pandas as pd

df = pd.read_excel('Ch5_Data.xlsx', sheet_name='MSFT Clean')

# Get the fiscal year and net income columns
# Save the results to a new DataFrame
df_Selected = df[['Fiscal Year', 'Net Income']]

print(df_Selected.tail(3))

    Fiscal Year  Net Income
31         2017     21204.0
32         2018     16571.0
33         2019     39240.0

#### Retrieving a Single Column as a Series

In [17]:
import pandas as pd
df = pd.DataFrame({'x': [1,2,3], 'xsq': [1,4,9]})

# Double brackets returns a DataFrame
print(type(df[['x']]))
# Single brackets returns a Series
print(type(df['x']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

### 5.5.2 Testing the Values in a Series

#### Comparing a Series to a Numeric Constant

In [18]:
import numpy as np
import pandas as pd

df = pd.read_excel('Ch5_Data.xlsx', sheet_name='MSFT Clean')
df['Fiscal Year'] > 2014

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29     True
30     True
31     True
32     True
33     True
Name: Fiscal Year, dtype: bool

#### Comparing a Series to another Series

In [19]:
import numpy as np
import pandas as pd

df = pd.read_excel('Ch5_Data.xlsx', sheet_name='MSFT Clean')
# Compare assets to equity. Save results in new_Series
new_Series = df['Assets - Total'] > df['Common Equity']
# Check whether all values in new_Series are True
new_Series.all()

True

### 5.3.3 Filtering a DataFrame

In [20]:
import pandas as pd

# Create a simple DataFrame
df = pd.DataFrame({'col1': ['a','b','c'], 
                   'col2': [1,2,3]})
print(f'df, unfiltered:\n{df}\n')

# Create a Boolean Series
sBool = pd.Series([True, False, True])

# Filter df using sBool
df_filt = df[sBool]
print(f'df filtered using sBool:\n{df_filt}')

df, unfiltered:
  col1  col2
0    a     1
1    b     2
2    c     3

df filtered using sBool:
  col1  col2
0    a     1
2    c     3

#### Filtering with a Single Condition

In [21]:
import pandas as pd
# Assume the data file is in the same folder
df = pd.read_excel('Ch5_Data_Example1.xlsx')

df[df['Ticker'] == 'MSFT']

  Company Name Ticker  Closing Price
0    Microsoft   MSFT         138.43

#### Filtering with Multiple Conditions

In [22]:
import pandas as pd
# Assumes the Excel file is in the same folder
df = pd.read_excel('Ch5_Data.xlsx', 
                   sheet_name='MSFT Clean')

# Filter 1: FY > 2013 and CEQ > $80 bil
df1 = df[(df['Fiscal Year'] > 2013) & 
         (df['Common Equity'] > 80000)]

# Filter2: FY < 1990 or FY > 2015
df2 = df[(df['Fiscal Year'] < 1990) | 
         (df['Fiscal Year'] > 2015)]

## 5.6 Creating New Columns

###  5.6.1 Creating a Column from a Scalar Value

In [23]:
df = pd.DataFrame({'col1': [1,2,3]})
df['newcol'] = 5
print(df)

   col1  newcol
0     1       5
1     2       5
2     3       5

###  5.6.2 Creating a Column from a List

In [24]:
df = pd.DataFrame({'col1': [1,2,3]})
df['newcol'] = ['a','b','c']
print(df)

   col1 newcol
0     1      a
1     2      b
2     3      c

### 5.6.3 Creating a Column as a Transformation of an Existing Column

In [25]:
import numpy as np
import pandas as pd
# Assume the file resides in the same
# folder as the code.
df = pd.read_excel('Ch5_Data.xlsx', 
                   sheet_name="MSFT Clean")

#### Example: Strip Whitespace from a String Column in Place

In [26]:
df['City'] = df['City'].str.strip()

#### Example: Convert a String Column to Uppercase in Place

In [27]:
df['State'] = df['State'].str.upper()

#### Example: Convert a Numeric Column from Millions to Actual

In [28]:
for col in ['Assets - Total', 
            'Common Equity', 
            'Net Income']:
    df[f'{col} ACTUAL'] = df[col] * 1000000

### 5.6.4 Creating a Column as a Combination of Multiple Columns

In [29]:
# Compute ROA
df['ROA'] = df['Net Income'] / df['Assets - Total']

# Compute full address
df['Full Address'] = df['Address'] + '\n' + df['City'] + ', ' + df['State'] + ' ' + df['ZIP Code'].astype(str)

## 5.7 Dropping and Renaming Columns

### 5.7.2 Renaming Columns

In [30]:
# Create a simple DataFrame
df = pd.DataFrame({'col1': [1,2,3], 'col2': [1,4,9]})
# Rename col1 to X and col2 to X_sq
df = df.rename(columns={'col1': 'X', 'col2': 'Xsq'})
print(df)

   X  Xsq
0  1    1
1  2    4
2  3    9

## 5.8 Sorting Data

In [36]:
# Create a simple DataFrame
df = pd.DataFrame({'Y': ['b','a','a','b'],
                   'X': [2,4,3,1]})
# Sort by column Y descending, then by column X ascending
df.sort_values(by=['Y', 'X'], ascending=[False,True], inplace=True)
print(df)

   Y  X
3  b  1
0  b  2
2  a  3
1  a  4